public/programming/mathematics/mathematics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../../subjects.html">Subjects</a> &gt;
</p>

<div id="outline-container-org7c12b2b" class="outline-2">
<h2 id="org7c12b2b">Mathematics</h2>
<div class="outline-text-2" id="text-org7c12b2b">
<p>
One of the things I am more grateful for to university is getting me
introduced to the ideas of Mathematics. During high school, I had math
as one of the primary subjects, we went through the basics of algebra
and calculus up until integrals. In university the pace changed, and I
notices I was not used to <b>thinking</b> about math.
</p>

<p>
Up until my last year of bachelor, math was all about a lot of
exercises, memorizing formulas and "pattern match" problems. This was
how I was taught for my entire life and It took me a great effort and
time to leave this mentality.
</p>

<p>
At my last year I finally began developing a kind of maturity for math
and only then I really started enjoying It. It surely requires a lot
of thinking and intellectual effort but I find It rewarding, here I
will document my journey in the realm of mathematics.
</p>

<p>
&#x2013; <a href="notes.html">notes</a> -
</p>

<hr />

<p>
Travel: <a href="../../subjects.org.html">Subjects</a>, <a href="../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
